---
kind: type
id: T:Autodesk.Revit.ApplicationServices.LanguageType
source: html/dfda33cf-cbff-9fde-6672-38402e87510f.htm
---
# Autodesk.Revit.ApplicationServices.LanguageType

An enumerated type containing the supported Revit product languages.

## Syntax (C#)
```csharp
public enum LanguageType
```